In [1]:
import arrow
import pandas as pd
from datetime import datetime
import numpy as np

def convert_todate(df, column_name):
    data_series = []
    len_data = len(df[column_name])
    for idx in range(len_data):
        data = df[column_name].iloc[idx]
        try:
            at = arrow.get(data)
            date = at.date()
            data = date
        except: # jika NAN or NAT
            data = "0000-00-00"

        data_series.append(data)

    df[column_name] = data_series
    return df

In [2]:
df = pd.read_csv("../data/ASET_GEDUNG_BANGUNAN.csv", sep='|', encoding='ISO-8859-1')

/opt/anaconda3/envs/work/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3063: DtypeWarning: Columns (33,34) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
df.head()

,KODE_KL,NAMA_KL,KODE_KPKNL,NAMA_KPKNL,KODE_SATKER,NAMA_SATKER,KODE_SUB_SATKER,NAMA_SUB_SATKER,KELOMPOK,SUB_KELOMPOK,...,STATUS_SBSN,STATUS_IDLE,KD_BRG_TANAH,UR_BRG_TANAH,NUP_TANAH,KD_SATKER_TANAH,NM_SATKER_TANAH,TGL_TARIK,TOT_PEGAWAI,URAIAN_PROVINSI
0,60,KEPOLISIAN NEGARA RI,7104.0,KPKNL JAKARTA IV,060010100642122000KD,POLRES METRO JAKARTA UTARA,060010100642122000KD,POLRES METRO JAKARTA UTARA,BANGUNAN GEDUNG TEMPAT TINGGAL,ASRAMA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20200225.0,NaN,NaN
1,60,KEPOLISIAN NEGARA RI,7104.0,KPKNL JAKARTA IV,060010100642122000KD,POLRES METRO JAKARTA UTARA,060010100642122000KD,POLRES METRO JAKARTA UTARA,BANGUNAN GEDUNG TEMPAT TINGGAL,ASRAMA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20200225.0,NaN,NaN
2,60,KEPOLISIAN NEGARA RI,7104.0,KPKNL JAKARTA IV,060010100642122000KD,POLRES METRO JAKARTA UTARA,060010100642122000KD,POLRES METRO JAKARTA UTARA,BANGUNAN GEDUNG TEMPAT TINGGAL,ASRAMA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20200225.0,NaN,NaN
3,60,KEPOLISIAN NEGARA RI,2103.0,KPKNL PEMATANG SIANTAR,060010700650570000KD,POLRES TEBING TINGGI,060010700650570000KD,POLRES TEBING TINGGI,BANGUNAN GEDUNG TEMPAT TINGGAL,ASRAMA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20200225.0,NaN,NaN
4,60,KEPOLISIAN NEGARA RI,7104.0,KPKNL JAKARTA IV,060010100642122000KD,POLRES METRO JAKARTA UTARA,060010100642122000KD,POLRES METRO JAKARTA UTARA,BANGUNAN GEDUNG TEMPAT TINGGAL,ASRAMA,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,20200225.0,NaN,NaN

In [4]:
df.columns

Index(['KODE_KL', 'NAMA_KL', 'KODE_KPKNL', 'NAMA_KPKNL', 'KODE_SATKER',
       'NAMA_SATKER', 'KODE_SUB_SATKER', 'NAMA_SUB_SATKER', 'KELOMPOK',
       'SUB_KELOMPOK', 'KODE_BARANG', 'NAMA_BARANG', 'NUP', 'NO_KIB',
       'TANGGAL_PEROLEHAN', 'TGL_BUKU', 'TGL_REKAM', 'TGL_REKAM_PERTAMA',
       'NILAI_PEROLEHAN_PERTAMA', 'NILAI_MUTASI', 'NILAI_PEROLEHAN',
       'NILAI_PENYUSUTAN', 'NILAI_BUKU', 'KONDISI', 'MERK', 'KUANTITAS',
       'SBSK', 'OPTIMALISASI', 'KD_KABKOTA', 'NM_KABKOTA', 'KODE_PROVINSI',
       'KODE_POS', 'JALAN', 'LATITUDE', 'LONGITUDE', 'LUAS_BANGUNAN',
       'LUAS_DASAR_BANGUNAN', 'JUMLAH_LANTAI', 'NO_DANA', 'TGL_DANA', 'DARI',
       'ASL_PERLH', 'TGL_PERLH', 'NO_SK_PSP', 'TGL_SK_PSP', 'JUMLAH_FOTO',
       'JUMLAH_KIB', 'STATUS_PENGELOLAAN', 'JENIS_SERTIFIKAT',
       'NO_DOK_KEPEMILIKAN', 'DOK_KEPEMILIKAN', 'JNS_DOK_KEPEMILIKAN',
       'DOKUMEN', 'STATUS_PENGGUNAAN', 'JENIS_PENGGUNA', 'KD_SATKER_PENGGUNA',
       'UR_SATKER_PENGGUNA', 'ALAMAT_SATKER_PENGGUNA', 'STATUS_SBSN',
       'STATUS_IDLE', 'KD_BRG_TANAH', 'UR_BRG_TANAH', 'NUP_TANAH',
       'KD_SATKER_TANAH', 'NM_SATKER_TANAH', 'TGL_TARIK', 'TOT_PEGAWAI',
       'URAIAN_PROVINSI'],
      dtype='object')

In [6]:
cname = ['TANGGAL_PEROLEHAN', 'TGL_BUKU', 'TGL_REKAM', 'TGL_REKAM_PERTAMA', 'TGL_DANA', 'TGL_PERLH',  'TGL_SK_PSP',
        'TGL_TARIK']
len(cname)

8

In [7]:
cname[0]

'TANGGAL_PEROLEHAN'

In [8]:
df[cname[0]]

0        1971-01-01 00:00:00
1        1997-01-01 00:00:00
2        1983-01-01 00:00:00
3        1995-01-01 00:00:00
4        1976-01-01 00:00:00
                ...
42276    1950-01-01 00:00:00
42277    1950-01-01 00:00:00
42278    1950-01-01 00:00:00
42279    1950-01-01 00:00:00
42280    1950-01-01 00:00:00
Name: TANGGAL_PEROLEHAN, Length: 42281, dtype: object

In [9]:
df = convert_todate(df, column_name=cname[0])
df[cname[0]]

0        1971-01-01
1        1997-01-01
2        1983-01-01
3        1995-01-01
4        1976-01-01
            ...
42276    1950-01-01
42277    1950-01-01
42278    1950-01-01
42279    1950-01-01
42280    1950-01-01
Name: TANGGAL_PEROLEHAN, Length: 42281, dtype: object

In [10]:
df[cname[1]]

0        2017-11-15 00:00:00
1        2017-11-15 00:00:00
2        2017-11-15 00:00:00
3        2019-12-31 00:00:00
4        2017-11-15 00:00:00
                ...
42276    2017-12-20 00:00:00
42277    2017-12-20 00:00:00
42278    2017-12-20 00:00:00
42279    2017-12-20 00:00:00
42280    2017-12-20 00:00:00
Name: TGL_BUKU, Length: 42281, dtype: object

In [11]:
df = convert_todate(df, column_name=cname[1])
df[cname[1]]

0        2017-11-15
1        2017-11-15
2        2017-11-15
3        2019-12-31
4        2017-11-15
            ...
42276    2017-12-20
42277    2017-12-20
42278    2017-12-20
42279    2017-12-20
42280    2017-12-20
Name: TGL_BUKU, Length: 42281, dtype: object

In [12]:
df[cname[2]]

0        2017-11-15 00:00:00
1        2017-11-15 00:00:00
2        2017-11-15 00:00:00
3        2019-12-31 00:00:00
4        2017-11-15 00:00:00
                ...
42276    2017-12-20 00:00:00
42277    2017-12-20 00:00:00
42278    2017-12-20 00:00:00
42279    2017-12-20 00:00:00
42280    2017-12-20 00:00:00
Name: TGL_REKAM, Length: 42281, dtype: object

In [13]:
df = convert_todate(df, column_name=cname[2])
df[cname[2]]

0        2017-11-15
1        2017-11-15
2        2017-11-15
3        2019-12-31
4        2017-11-15
            ...
42276    2017-12-20
42277    2017-12-20
42278    2017-12-20
42279    2017-12-20
42280    2017-12-20
Name: TGL_REKAM, Length: 42281, dtype: object

In [14]:
df[cname[3]]

0        2017-11-15 00:00:00
1        2017-11-15 00:00:00
2        2017-11-15 00:00:00
3        2008-03-01 00:00:00
4        2017-11-15 00:00:00
                ...
42276    2017-12-20 00:00:00
42277    2017-12-20 00:00:00
42278    2017-12-20 00:00:00
42279    2017-12-20 00:00:00
42280    2017-12-20 00:00:00
Name: TGL_REKAM_PERTAMA, Length: 42281, dtype: object

In [15]:
df = convert_todate(df, column_name=cname[3])
df[cname[3]]

0        2017-11-15
1        2017-11-15
2        2017-11-15
3        2008-03-01
4        2017-11-15
            ...
42276    2017-12-20
42277    2017-12-20
42278    2017-12-20
42279    2017-12-20
42280    2017-12-20
Name: TGL_REKAM_PERTAMA, Length: 42281, dtype: object

In [16]:
df[cname[4]]

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
42276    NaN
42277    NaN
42278    NaN
42279    NaN
42280    NaN
Name: TGL_DANA, Length: 42281, dtype: object

In [17]:
df = convert_todate(df, column_name=cname[4])
df[cname[4]]

0        0000-00-00
1        0000-00-00
2        0000-00-00
3        0000-00-00
4        0000-00-00
            ...
42276    0000-00-00
42277    0000-00-00
42278    0000-00-00
42279    0000-00-00
42280    0000-00-00
Name: TGL_DANA, Length: 42281, dtype: object

In [18]:
df[cname[5]]

0        1971-01-01 00:00:00
1        1997-01-01 00:00:00
2        1983-01-01 00:00:00
3        1995-01-01 00:00:00
4        1976-01-01 00:00:00
                ...
42276    1950-01-01 00:00:00
42277    1950-01-01 00:00:00
42278    1950-01-01 00:00:00
42279    1950-01-01 00:00:00
42280    1950-01-01 00:00:00
Name: TGL_PERLH, Length: 42281, dtype: object

In [19]:
df = convert_todate(df, column_name=cname[5])
df[cname[5]]

0        1971-01-01
1        1997-01-01
2        1983-01-01
3        1995-01-01
4        1976-01-01
            ...
42276    1950-01-01
42277    1950-01-01
42278    1950-01-01
42279    1950-01-01
42280    1950-01-01
Name: TGL_PERLH, Length: 42281, dtype: object

In [20]:
df[cname[6]]

0        NaN
1        NaN
2        NaN
3        NaN
4        NaN
        ...
42276    NaN
42277    NaN
42278    NaN
42279    NaN
42280    NaN
Name: TGL_SK_PSP, Length: 42281, dtype: object

In [21]:
df = convert_todate(df, column_name=cname[6])
df[cname[6]]

0        0000-00-00
1        0000-00-00
2        0000-00-00
3        0000-00-00
4        0000-00-00
            ...
42276    0000-00-00
42277    0000-00-00
42278    0000-00-00
42279    0000-00-00
42280    0000-00-00
Name: TGL_SK_PSP, Length: 42281, dtype: object

In [22]:
df['TGL_TARIK'] = df['TGL_TARIK'].fillna(0)
df['TGL_TARIK']

0        20200225.0
1        20200225.0
2        20200225.0
3        20200225.0
4        20200225.0
            ...
42276    20200225.0
42277    20200225.0
42278    20200225.0
42279    20200225.0
42280    20200225.0
Name: TGL_TARIK, Length: 42281, dtype: float64

In [23]:
df['TGL_TARIK'] = df['TGL_TARIK'].apply(np.int64)
df['TGL_TARIK']

0        20200225
1        20200225
2        20200225
3        20200225
4        20200225
           ...
42276    20200225
42277    20200225
42278    20200225
42279    20200225
42280    20200225
Name: TGL_TARIK, Length: 42281, dtype: int64

In [24]:
# declaration df to data variable
data = df
# declaration data series ('TGL_TARIK') to column_name
column_name = 'TGL_TARIK'

len_data = len(df)
# len_data = 10
data_series = []
for idx in range(len_data):
    len_data = len(df[column_name])
    data = df[column_name].iloc[idx]
    data = str(data)
    
    year = data[0:4]
    month = data[4:6]
    day = data[6:8]
    str_date = f'{year}-{month}-{day}'
#     print(str_date)

    try:
        at = arrow.get(str_date)
        date = at.date()
    except:
        str_date = f'0000-00-00'
#         at = arrow.get(str_date)
#         date = at.date()
        date = str_date
#         print(date)
#     print(date)

    data_series.append(date)

df[column_name] = data_series
df[column_name]
# return df

0        2020-02-25
1        2020-02-25
2        2020-02-25
3        2020-02-25
4        2020-02-25
            ...
42276    2020-02-25
42277    2020-02-25
42278    2020-02-25
42279    2020-02-25
42280    2020-02-25
Name: TGL_TARIK, Length: 42281, dtype: object

In [27]:
from sqlalchemy import create_engine

engine = create_engine('mysql://root:191618@localhost/db_logpolri')

In [28]:
df.to_sql('t_ASET_GEDUNG_BANGUNAN', con=engine, if_exists='append', chunksize=500, index=False)